config.org
#+title: My Doom Emacs Config
#+author: Vincent Montero
#+email: vincent_montero@icloud.com
#+description: My config file for Emacs with Doom and Scimax
#+property: headers-args :tangle
#+auto_tangle: t
#+startup: overview
#+exclude_tags: noexport
#+TODO: TODO FIXME LATER

* Notes

** [[https://github.com/doomemacs/doomemacs/blob/develop/docs/getting%5Fstarted.org#Configure][DoomEmacs config notice]]

** Interesting configs

https://github.com/nalhasan/emacsconf2020/blob/master/config.org
https://github.com/WouterSpekkink/dotfiles/blob/master/doom/config.el
http://www.wouterspekkink.org/academia/writing/tool/doom-emacs/2021/02/27/writing-academic-papers-with-org-mode.html

** Seeking help

Run elisp:emacs-version to share info

* Contact info

#+begin_src emacs-lisp :tangle yes
  (setq user-full-name "Vincent Montero"
        user-mail-address "vincent_montero@icloud.com")
#+end_src

* Org-auto-tangle

#+begin_src emacs-lisp :tangle yes
(use-package org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode)
  :config
  (setq org-auto-tangle-default t))
#+end_src

* Emacs packages

#+begin_src emacs-lisp :tangle yes
(require 'cc-mode)
#+end_src

#+begin_src emacs-lisp :tangle yes
(use-package f)
(use-package diminish)
(use-package lispy)
(use-package aggressive-indent)
(use-package ibuffer-projectile)
(use-package ivy-yasnippet
  :bind ("H-," . ivy-yasnippet))
(use-package ess-smart-equals)
#+end_src

* From [[https://github.com/jkitchin/scimax/tree/master][Scimax]]

** Packages

#+begin_src emacs-lisp :tangle yes
(setq scimax-dir "~/scimax/")
(setq scimax-user-dir "~/scimax/")

(add-to-list 'load-path (expand-file-name "~/scimax"))
(load "scimax-org")

(eval-after-load 'bibtex
  '(progn
     (require 'bibtex-hotkeys)))

(require 'jupyter)
(require 'ob-jupyter)
(require 'scimax-jupyter)
;;(global-unset-key (kbd "<f12>"))
(global-set-key (kbd "s-<") 'scimax/body)
(jupyter-org-define-key (kbd "s-<") #'scimax-jupyter-org-hydra/body)

(use-package words
  :bind ("H-w" . words-hydra/body))
(require 'scimax-ob)
;; (require 'scimax-autoformat-abbrev)
(require 'scimax-utils)
;; (require 'scimax-contacts)
(require 'scimax-hydra)
(require 'scimax-statistics)
(require 'scimax-journal)
(setq scimax-journal-root-dir (concat my/work-base-dir "journal"))

(easy-menu-add)
(eval-after-load 'easy-menu
  '(progn
     (require 'scimax-notebook)))

(require 'scimax-ivy) ; M-TAB for multiple selection
(require 'scimax-yas)
(require 'scimax-elfeed)
(require 'scimax-spellcheck)
(require 'scimax-apps)
#+end_src
** TODO Autoformat
#+begin_src emacs-lisp :tangle no
(add-hook 'org-mode-hook 'scimax-autoformat-mode)
(setq scimax-autoformat-superscripts nil)
(setq scimax-org-autoformat-ordinals t)
(setq scimax-org-autoformat-fractions t)
(setq scimax-org-autoformat-transposed-caps t)
(setq scimax-org-autoformat-superscripts t)
(setq scimax-org-autoformat-sentence-capitalization t)
(setq scimax-org-autoformat-am-pm t)
#+end_src

** TODO Abbreviations

#+begin_src emacs-lisp :tangle no
(scimax-toggle-abbrevs 'scimax-month-abbreviations +1)
(scimax-toggle-abbrevs 'scimax-weekday-abbreviations +1)
(scimax-toggle-abbrevs 'scimax-contraction-abbreviations +1)
(scimax-toggle-abbrevs 'scimax-transposition-abbreviations +1)
(scimax-toggle-abbrevs 'scimax-chemical-formula-abbreviations +1)
(scimax-toggle-abbrevs 'scimax-misc-abbreviations +1)
#+end_src

* Visual settings

** Theme

#+begin_src emacs-lisp :tangle yes
(setq doom-theme 'doom-dracula)
#+end_src

** Display time

#+begin_src emacs-lisp :tangle yes
(setq display-time-day-and-date t)
(display-time)
(display-time-mode 1)
;;(add-hook 'after-init-hook (lambda () (org-agenda nil "o")))
#+end_src

** Display battery

#+begin_src emacs-lisp :tangle yes
(display-battery-mode 1)
#+end_src

** Scroll conservatively

#+begin_src emacs-lisp :tangle yes
(setq scroll-conservatively 100)
#+end_src

** Fullscreen

#+begin_src emacs-lisp :tangle yes
(add-to-list 'initial-frame-alist '(fullscreen . maximized))
#+end_src

** Modeline and numbering

#+begin_src emacs-lisp :tangle yes
(setq display-line-numbers-type t)
(global-display-line-numbers-mode)
(setq doom-modeline-enable-word-count t)

;;Highlight current line
(global-hl-line-mode)

;;Scroll and Tool bar modes
(recentf-mode 1)
(scroll-bar-mode -1)
(tool-bar-mode -1)
#+end_src

** Coloring code blocks

*** Yes

#+begin_src emacs-lisp :tangle no
(setq org-src-block-faces '(("emacs-lisp" (:background "LightCyan1" :extend t))
			     ("sh" (:background "gray90" :extend t))
			     ("python" (:background "DarkSeaGreen1" :extend t))
			     ("ipython" (:background "thistle1" :extend t))
			     ("jupyter-python" (:background "thistle1" :extend t))))
#+end_src

*** No

#+begin_src emacs-lisp :tangle yes
(after! org
  (setq org-src-block-faces nil)
  )
#+end_src

** Pretty

#+begin_src emacs-lisp :tangle yes
(use-package org-superstar
  :config
  (setq org-superstar-special-todo-items t)
  (setq org-hide-leading-stars t)
  (add-hook 'org-mode-hook (lambda ()
                             (org-superstar-mode 1))))

(setq org-pretty-entities t)

(setq org-hide-emphasis-markers t)


(use-package org-appear
  :hook (org-mode . org-appear-mode))

(with-eval-after-load 'org-superstar
  (setq org-superstar-item-bullet-alist
        '((?* . ?•)
          (?+ . ?➤)
          (?- . ?-)))
  (setq org-superstar-special-todo-items t))
#+end_src

** Beacon

#+begin_src emacs-lisp :tangle yes
(beacon-mode 1)
#+end_src

** Inline images

#+begin_src emacs-lisp :tangle yes
(setq org-startup-with-inline-images nil)
#+end_src

* Keybindings

https://www.masteringemacs.org/article/mastering-key-bindings-emacs
https://rameezkhan.me/posts/2020/2020-07-03--adding-keybindings-to-doom-emacs/

** Split right and left command keys

#+BEGIN_SRC emacs-lisp :tangle yes
;; Meta key on apple keyboard
(setq ns-alternate-modifier 'meta)
(setq ns-right-alternate-modifier 'none)
#+END_SRC

** Modify apple keyboard: C - M - s - H

#+BEGIN_SRC emacs-lisp :tangle yes
;; set keys for Apple keyboard, for emacs in OS X
(setq mac-control-modifier 'control) ; make Control key do Control
(setq mac-option-modifier 'meta) ; make cmd left key do Meta
(setq mac-left-command-modifier 'super) ; make left opt key do Super
(setq mac-right-command-modifier 'hyper)  ; make cmd right key do Hyper
#+END_SRC

** Toggle truncated lines

#+begin_src emacs-lisp :tangle yes
(global-set-key (kbd "M-q") 'toggle-truncate-lines)
#+end_src

* TODO Email: mu4e

#+begin_src emacs-lisp :tangle yes
(add-to-list 'load-path "/opt/homebrew/Cellar/mu/1.8.14/share/emacs/site-lisp/mu/mu4e")
;; (require 'mu4e)
(require 'smtpmail)
#+end_src

* [[https://github.com/skeeto/elfeed][Elfeed]]

** Elfeed goodies

#+begin_src emacs-lisp :tangle yes
(require 'elfeed-goodies)
(elfeed-goodies/setup)
(setq elfeed-goodies/entry-pane-size 0.6)
#+end_src

** TODO [[https://github.com/sp1ff/elfeed-score][Elfeed-score]]

https://www.unwoundstack.com/doc/elfeed-score/curr

#+begin_src emacs-lisp :tangle no
(use-package! elfeed-score
  :after elfeed
  :config
  (elfeed-score-enable)
  (define-key elfeed-search-mode-map "=" elfeed-score-map))

(setq elfeed-search-print-entry-function #'elfeed-score-print-entry)
#+end_src

** [[https://github.com/remyhonig/elfeed-org][Elfeed-org]]

#+begin_src emacs-lisp :tangle yes
(use-package elfeed-org
  :config
  (elfeed-org)
  (setq rmh-elfeed-org-files (list "~/.doom.d/elfeed.org")))
#+end_src

** Keymaps

#+begin_src emacs-lisp :tangle yes
(map! :leader
      :desc "Elfeed"
       "e e" #'elfeed
       "e u" #'elfeed-update)
#+end_src

#+begin_src emacs-lisp :tangle yes
(evil-define-key 'normal elfeed-show-mode-map
  (kbd "J") 'elfeed-goodies/split-show-next
  (kbd "K") 'elfeed-goodies/split-show-prev
  (kbd "E") 'email-elfeed-entry
  (kbd "C") (lambda () (interactive) (org-capture))
  (kbd "D") 'doi-utils-add-entry-from-elfeed-entry
  ;; help me alternate fingers in marking entries as read
  (kbd "F") 'elfeed-search-untag-all-unread
  (kbd "O") 'elfeed-search-show-entry)

(evil-define-key 'normal elfeed-search-mode-map
  (kbd "J") 'elfeed-goodies/split-show-next
  (kbd "K") 'elfeed-goodies/split-show-prev)
#+end_src

* Aspell and Flycheck

Aspell is a spell checker.
Since I write in multiple languages, I have set it up to cycle through spanish, english and french.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq ispell-program-name "aspell")
(setq ispell-list-command "list")
(setq-default ispell-dictionary "english")


(let ((langs '("british" "french" "spanish")))
  (setq lang-ring (make-ring (length langs)))
  (dolist (elem langs) (ring-insert lang-ring elem)))

(defun cycle-ispell-languages ()
  (interactive)
  (let ((lang (ring-ref lang-ring -1)))
    (ring-insert lang-ring lang)
    (ispell-change-dictionary lang)))
(global-set-key (kbd "H-m") 'cycle-ispell-languages)
#+END_SRC

#+begin_src emacs-lisp :tangle no
(use-package flycheck
  ;; Jun 28 - I like this idea, but sometimes this is too slow.
  :config
  (add-hook 'text-mode-hook #'flycheck-mode)
  (add-hook 'org-mode-hook #'flycheck-mode)
  (define-key flycheck-mode-map (kbd "s-;") 'flycheck-previous-error))
#+end_src

* Formatting

** Keybindings

#+begin_src emacs-lisp :tangle yes
(global-set-key (kbd "H--") 'org-subscript-region-or-point)
(global-set-key (kbd "H-=") 'org-superscript-region-or-point)
(global-set-key (kbd "H-i") 'org-italics-region-or-point)
(global-set-key (kbd "H-b") 'org-bold-region-or-point)
(global-set-key (kbd "H-v") 'org-verbatim-region-or-point)
(global-set-key (kbd "H-c") 'org-code-region-or-point)
(global-set-key (kbd "H-u") 'org-underline-region-or-point)
(global-set-key (kbd "H-+") 'org-strikethrough-region-or-point)
(global-set-key (kbd "H-4") 'org-latex-math-region-or-point)
(global-set-key (kbd "H-e") 'ivy-insert-org-entity)
(global-set-key (kbd "H-\"") 'org-double-quote-region-or-point)
(global-set-key (kbd "H-'") 'org-single-quote-region-or-point)
#+end_src

** IC_{50}

#+begin_src emacs-lisp :tangle yes
(defun my/org-mode-IC50-autoformat ()
  "Autoformat IC50 as IC_{50} in Org-mode."
  (interactive)
  (save-excursion
    (goto-char (point-min))
    (while (search-forward "IC50" nil t)
      (replace-match "IC_{50}"))))
#+end_src

* Taking Notes: Roam

