config.org
** [[https://www.orgroam.com][Org-roam]]

Set up in Doom's init.el file (org +roam2).
With the biblio module toggled on, Doom uses the [[https://github.com/emacs-citar/citar-org-roam][citar-org-roam]] to integrate notes to [[https://www.orgroam.com][org-roam]].
As such, [[https://github.com/emacs-citar/citar-org-roam][citar-org-roam]] can be viewed as a competitor to org-roam-bibtex

** [[https://github.com/org-roam/org-roam-ui][Org-roam UI]]

#+begin_src emacs-lisp :tangle yes
(use-package! websocket
    :after org-roam)

(use-package! org-roam-ui
    :after org-roam ;; or :after org
;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
;;         a hookable mode anymore, you're advised to pick something yourself
;;         if you don't care about startup time, use
;;  :hook (after-init . org-roam-ui-mode)
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))

(setq org-roam-graph-executable "/opt/homebrew/Cellar/graphviz/8.0.5/bin/dot")
(setq org-roam-graph-viewer "/System/Volumes/Preboot/Cryptexes/App/System/Applications/Safari.app/Contents/MacOS/Safari")
#+end_src

** Citar [[https://github.com/org-roam/org-roam-bibtex][Org-roam-bibtex]]

This code wraps the bibtex-completion-edit-notes-function to use citar-open-notes instead.
Still doesnt work.

#+begin_src emacs-lisp :tangle yes
(require 'citar)
(require 'citar-org-roam)

(defvar bibtex-completion-edit-notes-function #'citar-open-notes
  "Function used to edit notes.
The function should accept one argument, a list of BibTeX keys.")

(defun bibtex-completion-edit-notes (keys)
  "Open the notes associated with KEYS using `bibtex-completion-edit-notes-function'."
  (funcall bibtex-completion-edit-notes-function keys))
#+end_src

* Bibliography

https://blog.tecosaur.com/tmio/2021-07-31-citations.html

** Org-mac-link

#+begin_src emacs-lisp :tangle yes
(use-package org-mac-link)
#+end_src

* PDFs

** Open pdf files inside/outside emacs

*** From LaTeX export

#+begin_src emacs-lisp :tangle yes
(eval-after-load 'org '(require 'org-pdfview))
#+end_src

*** From bibtex files

**** Outside Emacs

Opening PDF files outside emacs, by default PDFs open in PDFTools:

#+begin_src emacs-lisp :tangle yes
(setq! bibtex-completion-pdf-open-function  (lambda (fpath)
                                           (call-process "open" nil 0 nil fpath))
     )
#+end_src

**** Inside emacs in vertical split

#+begin_src emacs-lisp :tangle no
(defun my-pdf-tools-open-function (file)
  "Open FILE using PDF tools in a vertical split new window."
  (let ((buffer (find-file-noselect file)))
    (if (fboundp 'pdf-tools-install)
        (progn
          (split-window-right)
          (other-window 1)
          (pdf-tools-install))
      (message "PDF tools not available"))
    (switch-to-buffer buffer)))

(setq bibtex-completion-pdf-open-function #'my-pdf-tools-open-function)
#+end_src

** PDF-tools set-up

#+begin_src emacs-lisp :tangle no
(pdf-loader-install)
(use-package pdf-tools
  :config
  (setq-default pdf-view-display-size 'fit-page)
  (setq pdf-annot-activate-created-annotations t)
  (define-key pdf-view-mode-map (kbd "C-s") 'isearch-forward)
  (add-hook 'pdf-view-mode-hook (lambda () (cua-mode 0)))
  (setq pdf-view-resize-factor 1.1)
  (define-key pdf-view-mode-map (kbd "h") 'pdf-annot-add-highlight-markup-annotation)
  (define-key pdf-view-mode-map (kbd "t") 'pdf-annot-add-text-annotation)
  (define-key pdf-view-mode-map (kbd "D") 'pdf-annot-delete))
#+end_src

** [[https://github.com/fuxialexander/org-pdftools/tree/master][Org-pdftools]]

#+begin_src emacs-lisp :tangle yes
(use-package! org-pdftools
  :hook (org-mode . org-pdftools-setup-link))
#+end_src

** Org-noter

** FIXME Org-noter-pdftools

There are some issues with org-noter-pdftools : cannot extract article's skeleton.

#+begin_src emacs-lisp :tangle no
(use-package! org-noter-pdftools
  :after org-noter
  :config
  ;; Add a function to ensure precise note is inserted
  (defun org-noter-pdftools-insert-precise-note (&optional toggle-no-questions)
    (interactive "P")
    (org-noter--with-valid-session
     (let ((org-noter-insert-note-no-questions (if toggle-no-questions
                                                   (not org-noter-insert-note-no-questions)
                                                 org-noter-insert-note-no-questions))
           (org-pdftools-use-isearch-link t)
           (org-pdftools-use-freepointer-annot t))
       (org-noter-insert-note (org-noter--get-precise-info)))))

  ;; fix https://github.com/weirdNox/org-noter/pull/93/commits/f8349ae7575e599f375de1be6be2d0d5de4e6cbf
  (defun org-noter-set-start-location (&optional arg)
    "When opening a session with this document, go to the current location.
With a prefix ARG, remove start location."
    (interactive "P")
    (org-noter--with-valid-session
     (let ((inhibit-read-only t)
           (ast (org-noter--parse-root))
           (location (org-noter--doc-approx-location (when (called-interactively-p 'any) 'interactive))))
       (with-current-buffer (org-noter--session-notes-buffer session)
         (org-with-wide-buffer
          (goto-char (org-element-property :begin ast))
          (if arg
              (org-entry-delete nil org-noter-property-note-location)
            (org-entry-put nil org-noter-property-note-location
                           (org-noter--pretty-print-location location))))))))
  (with-eval-after-load 'pdf-annot
    (add-hook 'pdf-annot-activate-handler-functions #'org-noter-pdftools-jump-to-note))
    )
#+end_src

** Org-ref-open-pdf-at-point

#+begin_src emacs-lisp :tangle no
(defun my/org-ref-open-pdf-at-point ()
  "Open the pdf for bibtex key under point if it exists."
  (interactive)
  (let* ((results (org-ref-get-bibtex-key-and-file))
         (key (car results))
         (pdf-file (car (bibtex-completion-find-pdf key))))
    (if (file-exists-p pdf-file)
        (org-open-file pdf-file)
      (message "No PDF found for %s" key))))
(setq org-ref-open-pdf-function 'my/org-ref-open-pdf-at-point)
#+end_src

** BUG: Enabling annotations

BUG SOLVING: Essential to make pdf-tools working within emacs.

#+begin_src emacs-lisp :tangle yes
(add-hook 'pdf-tools-enabled-hook 'pdf-view-dark-minor-mode)
#+end_src

** Remap keybindings

Does not work...

#+begin_src emacs-lisp :tangle no
(map! :after pdf-tools
      :map (pdf-view-mode-map pdf-annot-minor-mode-maP)
      :prefix "SPC j"
      :desc "Highlight"
      "h" #'pdf-annot-add-highlight-markup-annotation
      :desc "Add text"
      "t" #'pdf-annot-add-text-annotation
      :desc "Markup"
      "m" #'pdf-annot-add-markup-annotation
      :desc "Mouse add text"
      "T" #'pdf-annot-mouse-add-text-annotation
      :desc "Squiggly"
      "s" #'pdf-annot-add-squiggly-markup-annotation
      :desc "strikeout"
      "+" #'pdf-annot-add-strikeout-markup-annotation
      :desc "underline"
      "u" #'pdf-annot-add-underline-markup-annotation
      )
#+end_src

* Presentations

#+begin_src emacs-lisp :tangle yes
(defun efs/presentation-setup ()
  (setq text-scale-mode-amount 3)
  (org-display-inline-images) ;; Can also use org-startup-with-inline-images
  (text-scale-mode 1))

(defun efs/presentation-end ()
  (text-scale-mode 0))

(use-package org-tree-slide
  :hook ((org-tree-slide-play . efs/presentation-setup)
         (org-tree-slide-stop . efs/presentation-end))
  :custom
  (org-tree-slide-slide-in-effect nil)
  (org-tree-slide-activate-message "Presentation started!")
  (org-tree-slide-deactivate-message "Presentation finished!")
  (org-tree-slide-header t)
  (org-tree-slide-breadcrumbs " // ")
  (org-image-actual-width nil))

;; (setq face-remapping-alist '((default (:height 2.4) default)
;;                              (italic (sheight 2.4) italic)))
#+end_src

* Org-agenda files

* Export

** Latex

*** Export process

Keep relative and absolute paths from org-cite

#+begin_src emacs-lisp :tangle yes
(setq org-latex-title-command "")

(setq org-latex-prefer-user-labels t)

(setq org-latex-pdf-process
      '("pdflatex -interaction nonstopmode -shell-escape -output-directory %o %f"
        "bibtex $(basename %b)"
        "pdflatex -interaction nonstopmode -shell-escape -output-directory %o %f"
        "pdflatex -interaction nonstopmode -shell-escape -output-directory %o %f")
      )
#+end_src

*** Packages

