config.el

(setq org-latex-default-packages-alist
      '(
        ("" "graphicx" nil)       ;; For including images and graphics.
        ("" "longtable" nil)      ;; For creating tables that span multiple pages.
        ("T1" "fontenc" nil)      ;; For specifying font encoding.
        ("AUTO" "inputenc" nil)   ;; For specifying the input encoding, typically UTF-8.
        ("" "lmodern" nil)      ;; This is for handling accented characters
        ("" "textcomp" nil)     ;; Provides additional symbols and text-related commands.
        ("" "amsmath" nil)      ;; Fundamental for mathematical formatting and equations.
        ("linktocpage, pdfstartview=FitH, colorlinks, linkcolor=blue, anchorcolor=blue, citecolor=blue, filecolor=blue, menucolor=blue, urlcolor=blue" "hyperref" nil) ;; Adds support for hyperlinks within the document when exporting to PDF.
        ("top=1in, bottom=1.in, left=1in, right=1in" "geometry" nil) ;; For setting page dimensions and margins.
        ("" "setspace" nil)     ;; Allows adjusting line spacing. /!\ Conflict with biblatex in beamer ?????
        ("" "xcolor" nil)       ;; For color support in the document.
        ("" "indentfirst" ni)   ;; Indents the first paragraph of each section.
        ("numbers,super,sort&compress" "natbib" nil) ;; For bibliographic citations and references.
        ("" "enumitem" nil)     ;; Control layout of itemize, enumerate, description, Customizes the formatting of lists (enumerate, itemize).
        ("" "tabularx" nil)     ;; Enhanced support for tables with variable column widths.
        ("" "calc" nil)         ;; Adds mathematical calculations to LaTeX commands.
        ("" "ifthen" nil)       ;; Provides conditional commands.
        ("" "listings" nil)     ;; For formatting code listings.
        ("" "float" nil)        ;; Improves the formatting of floating elements like figures and tables.
        ("" "fancyvrb" nil)     ;; Enhances the formatting of verbatim text.
        ("" "amssymb" nil)      ;; Provides additional mathematical symbols.
        ("" "amsthm" nil)       ;; Adds support for theorems and theorem-like environments.
        ("" "parskip" nil)      ;; Adjusts paragraph spacing and indentation.
        ("" "footmisc" nil)     ;; Customizes footnote formatting.
        ("" "textgreek" nil)    ;; Allows input of Greek characters in text mode.
        ("" "babel" nil)        ;; For multilingual support and language-specific formatting.
        ("" "csquotes" nil)     ;; Enhances quotation marks and citation styles.
        ("" "url" nil)          ;; Allows formatting of URLs.
        )
      )

(add-to-list 'org-latex-packages-alist '("" "marginnote" nil))  ;; For left column
(add-to-list 'org-latex-packages-alist '("" "marginfix" nil))   ;; For command \clearmargin for manually moving the left column to the next page
(add-to-list 'org-latex-packages-alist '("" "fancyhdr" nil))    ;; Extensive control of page headers and footers in LATEX2ε
(add-to-list 'org-latex-packages-alist '("" "lastpage" nil))    ;; Reference last page for Page N of M type footers
(add-to-list 'org-latex-packages-alist '("" "etoolbox" nil))    ;; for \AtBeginDocument etc.
(add-to-list 'org-latex-packages-alist '("" "tabto" nil))       ;; To use tab for alignment on first page
(add-to-list 'org-latex-packages-alist '("" "totcount" nil))    ;; To enable extracting the value of the counter "page"
(add-to-list 'org-latex-packages-alist '("" "ragged2e" nil))    ;; For command \justifying
(add-to-list 'org-latex-packages-alist '("" "pbox" nil))        ;; For biography environment
(add-to-list 'org-latex-packages-alist '("" "enotez" nil))      ;; For endnotes
(add-to-list 'org-latex-packages-alist '("" "rotating" nil))    ;; Rotation tools, including rotated full-page floats

(add-to-list 'org-latex-packages-alist '("right" "lineno" t))           ;; Line numbers on paragraphs
(add-to-list 'org-latex-packages-alist '("" "soul" nil))                ;; To highlight text
(add-to-list 'org-latex-packages-alist '("normalem" "ulem" nil))        ;; Package for underlining
(add-to-list 'org-latex-packages-alist '("" "microtype" nil))           ;; For command \textls[]{}
(add-to-list 'org-latex-packages-alist '("strings" "underscore" nil))
(add-to-list 'org-latex-packages-alist '("" "marvosym" t))              ;; Martin Vogel's Symbols (marvosym) font, contains the Euro currency symbol
(add-to-list 'org-latex-packages-alist '("" "wasysym" t))               ;; support for the wasy fonts (Waldi Symbol) by Roland Waldi provides many glyphs like male and female symbols and astronomical symbols

(add-to-list 'org-latex-packages-alist '("" "natmove" nil))     ;; The package has only one purpose: to move superscripted citations beyond punctuation

(add-to-list 'org-latex-packages-alist '("" "url" nil))

(add-to-list 'org-latex-packages-alist '("" "pdfpages" nil))           ; Include PDF documents in LATEX
(add-to-list 'org-latex-packages-alist '("" "attachfile" nil))  ;; Attach arbitrary files to a PDF document

(add-to-list 'org-latex-packages-alist '("" "adjustbox" nil))     ;; Graphics package-alike macros for “general” boxes
(add-to-list 'org-latex-packages-alist '("skip=0.5 \\baselineskip" "caption" nil)) ; Customising captions in floating environments
(add-to-list 'org-latex-packages-alist '("" "float" nil))       ;; Improved interface for floating objects
(add-to-list 'org-latex-packages-alist '("" "wrapfig" nil))     ;; makes it possible to wrap text around figures

(add-to-list 'org-latex-packages-alist '("" "epstopdf" nil)) ; Convert EPS to PDF using Ghostscript
(add-to-list 'org-latex-packages-alist '("" "tikz" nil))            ; For \foreach used for Orcid icon
(add-to-list 'org-latex-packages-alist '("" "changepage" nil)) ; To adjust the width of the column for the title part and figures/tables (adjustwidth environment)
(add-to-list 'org-latex-packages-alist '("" "graphbox" nil)) ; To align graphics inside tables

(add-to-list 'org-latex-packages-alist '("" "longtable" nil))             ; Tabulars with adjustable-width columns
(add-to-list 'org-latex-packages-alist '("" "booktabs" nil))  ; for \toprule etc. in tables
(add-to-list 'org-latex-packages-alist '("" "multirow" nil))        ; Create tabular cells spanning multiple rows
(add-to-list 'org-latex-packages-alist '("" "array" nil))      ; For table array
(add-to-list 'org-latex-packages-alist '("" "xcolor, colortbl" nil)) ; To provide color for soul (for english editing), for adding cell color of table
(add-to-list 'org-latex-packages-alist '("" "longtable" nil))   ;; Allow tables to flow over page boundaries
(setq org-latex-tables-booktabs t)

(add-to-list 'org-latex-packages-alist '("" "glossaries" nil))
(add-to-list 'org-latex-packages-alist '("" "makeidx" nil))
