config.org
*** Journal abbreviation

https://kitchingroup.cheme.cmu.edu/blog/2014/10/11/Abbreviated-journal-names-in-bibtex/

#+begin_src emacs-lisp :tangle yes
(defvar bibtex-abbreviations
  '(
    ("ACAT" "ACS Catalysis" "ACS Catal.")
    ("AM" "Acta Materialia" "Acta Mater.")
    ("AMM" "Acta Metallurgica et Materialia" "Acta Metall. Mater.")
    ("AMiner" "American Mineralogist" "Am. Mineral.")
    ("AngC" "Angewandte Chemie International Edition" "Angew. Chem. Int. Edit.")
    ("APLM" "APL Materials" "APL Mat.")
    ("ACBE" "Applied Catalysis B: Environmental" "Appl. Catal. B-Environ.")
    ("APL" "Applied Physics Letters" "Appl. Phys. Lett.")
    ("ASS" "Applied Surface Science" "Appl. Surf. Sci.")
    ("CL" "Catalysis Letters" "Catal. Lett.")
    ("CT" "Catalysis Today" "Catal. Today")
    ("CPL" "Chemical Physics Letters" "Chem. Phys. Lett")
    ("CR" "Chemical Reviews" "Chem. Rev.")
    ("CSR" "Chemical Society Reviews" "Chem. Soc. Rev.")
    ("CSR" "Chemical Society Reviews" "Chem. Soc. Rev.")
    ("CM" "Chemistry of Materials" "Chem. Mater.")
    ("CSA" "Colloids and Surfaces, A: Physicochemical and Engineering Aspects" "Colloids Surf., A")
    ("CPMS" "Computational Materials Science" "Comp. Mater. Sci.")
    ("CPC" "Computer Physics Communications" "Comput. Phys. Commun.")
    ("CGD" "Crystal Growth \\& Design" "Cryst. Growth Des.")
    ("CEC" "CrystEngComm" "CrystEngComm")
    ("ECST" "ECS Transactions" "ECS Trans.")
    ("EES" "Energy \\& Environmental Science" "Energy Environ. Sci.")
    ("HPR" "High Pressure Research" "High Pressure Res.")
    ("IC" "Inorganic Chemistry" "Inorg. Chem.")
    ("IECR" "Industrial \\& Engineering Chemistry Research" "Ind. Eng. Chem. Res.")
    ("JJAP" "Japanese Journal of Applied Physics" "Jpn. J. Appl. Phys.")
    ("JMatR" "Journal of  Materials Research" "J. Mater. Res.")
    ("JALC" "Journal of Alloys and Compounds" "J. Alloy Compd.")
    ("JAC" "Journal of Applied Crystallography" "J. Appl. Crystallogr.")
    ("JAP" "Journal of Applied Physics" "J. Appl. Phys.")
    ("JC" "Journal of Catalysis" "J. Catal.")
    ("JCP" "Journal of Chemical Physics" "J. Chem. Phys.")
    ("JCG" "Journal of Crystal Growth" "J. Crys. Growth")
    ("JMC" "Journal of Materials Chemistry" "J. Mater. Chem.")
    ("JMC" "Journal of Materials Chemistry" "J. Mater. Chem.")
    ("JMSL" "Journal of Materials Science Letters" "J. Mater. Sci. Lett.")
    ("JMS" "Journal of Membrane Science" "J. Memb. Sci.")
    ("JPE" "Journal of Phase Equilibria" "J. Phase Equilib.")
    ("JPCS" "Journal of Physics and Chemistry of Solids" "J. Phys. Chem. Solids")
    ("JPCM" "Journal of Physics: Condensed Matter" "J. Phys.: Condens. Matter")
    ("JSSC" "Journal of Solid State Chemistry" "J. Solid State Chem.")
    ("JACerS" "Journal of the American Ceramic Society" "J. Am. Ceram. Soc.")
    ("JACS" "Journal of the American Chemical Society" "J. Am. Chem. Soc.")
    ("JES" "Journal of The Electrochemical Society" "J. Electrochem. Soc.")
    ("JES" "Journal of The Electrochemical Society" "J. Electrochem. Soc.")
    ("JMS" "Journal of Membrane Science" "J. Memb. Sci.")
    ("JVST" "Journal of Vacuum Science \\& Technology A" "J. Vac. Sci. Technol. A")
    ("ML" "Materials Letters" "Mater. Lett.")
    ("MSE-BS" "Materials Science and Engineering B" "Mat. Sci. Eng. B-Solid")
    ("MOLSIM" "Molecular Simulation" "Mol. Sim.")
    ("Nature" "Nature" "Nature")
    ("NM" "Nature Materials" "Nat. Mater.")
    ("PML" "Philosophical Magazine Letters" "Phil. Mag. Lett.")
    ("PMA" "Philosophical Magazine A" "Phil. Mag. A")
    ("PA" "Physica A: Statistical Mechanics and its Applications" "Physica A")
    ("PB" "Physica B-Condensed Matter" "Physica B")
    ("PCCP" "Physical Chemistry Chemical Physics" "Phys. Chem. Chem. Phys.")
    ("PSSB" "physica status solidi (b)" "Phys. Status Solidi B")
    ("PRA" "Physical Review A" "Phys. Rev. A")
    ("PRB" "Physical Review B" "Phys. Rev. B")
    ("PRL" "Physical Review Letters" "Phys. Rev. Lett.")
    ("PCM" "Physics and Chemistry of Minerals" "Phys. Chem. Miner.")
    ("PSurfSci" "Progress in Surface Science" "Prog. Surf. Sci.")
    ("Science" "Science" "Science")
    ("SABC" "Sensors and Actuators B: Chemical" "Sensor. Actuat. B-Chem.")
    ("SS" "Surface Science" "Surf. Sci.")
    ("EPJB" "The European Physical Journal B" "Eur. Phys. J. B")
    ("JPC" "The Journal of Physical Chemistry" "J. Phys. Chem.")
    ("JPCB" "The Journal of Physical Chemistry  B" "J. Phys. Chem. B")
    ("JPCC" "The Journal of Physical Chemistry C" "J. Phys. Chem. C")
    ("JCP" "The Journal of Chemical Physics" "J. Chem. Phys.")
    ("TSF" "Thin Solid Films" "Thin Solid Films")
    ("TC" "Topics in Catalysis" "Top. Catal.")
    ("WR" "Water Research" "Water Res.")

    ("AJCR" "American journal of cancer research" "Am. J. Cancer Res.")
    ("ACAMC" "Anti-Cancer Agents in Medicinal Chemistry" "Anti-Cancer Agents Med. Chem.")
    ("ACTPHARM" "Acta Pharmaceutica" "Acta Pharm.")
    ("ARCHPHARM" "Archiv der Pharmazie" "Arch. Pharm.")
    ("ACHEMBIO" "ACS Chemical Biology" "ACS Chem. Biol.")
    ("APTS" "ACS Pharmacology &amp; Translational Science" "ACS Pharmacol. Transl. Sci.")
    ("ACSOmega" "ACS Omega" "ACS Omega")
    ("ANNONC" "Annals of Oncology" "Ann. Oncol.")
    ("APOC" "Applied Organometallic Chemistry" "Appl. Organomet. Chem.")
    ("APSCI" "Applied Sciences" "Appl. Sci.-Basel")
    ("BIOORGCHEM" "Bioorganic Chemistry" "Bioorganic Chem.")
    ("BMC" "Bioorganic &amp; Medicinal Chemistry" "Bioorg. Med. Chem.")
    ("BMCL" "Bioorganic &amp; Medicinal Chemistry Letters" "Bioorg. Med. Chem. Lett.")
    ("BBR" "Biochemistry and Biophysics Reports" "Biochem. Biophys. Rep.")
    ("BBRC" "Biochemical and Biophysical Research Communications" "Biochem. Biophys. Res. Commun.")
    ("BCHEMAPP" "Bioinorganic Chemistry and Applications" "Bioinorg. Chem. Appl.")
    ("BIOCHEMPHARMA" "Biochemical Pharmacology" "Biochem. Pharmacol.")
    ("BRIEFBIOINF" "Briefings in Bioinformatics" "Brief. Bioinform.")
    ("BJC" "British Journal of Cancer" "Br. J. Cancer")
    ("BMJCR" "BMJ Case Reports" "BMJ Case Rep.")
    ("CANIVEST" "Cancer Investigation" "Cancer Invest.")
    ("CANLET" "Cancer Letters" "Cancer Lett.")
    ("CANRES" "Cancer Research" "Cancer Res.")
    ("CANCHEMPHARMA" "Cancer Chemotherapy and Pharmacology" "Cancer Chemother. Pharmacol.")
    ("CDD" "Cell Death Discovery" "Cell Death Discov.")
    ("CELLRES" "Cell Research" "Cell Res.")
    ("CHEMBIOD" "Chemistry &amp; Biodiversity" "Chem. Biodivers.")
    ("CHEMBIODD" "Chemical Biology &amp; Drug Design" "Chem. Biol. Drug Des.")
    ("CBI" "Chemico-Biological Interactions" "Chem.-Biol. Interact.")
    ("CLINCANRES" "Clinical Cancer Research" "Clin. Cancer Res.")
    ("COLSUFBIO" "Colloids and Surfaces B: Biointerfaces" "Colloid Surf. B-Biointerfaces")
    ("CURRCOMPDD" "Current Computer-Aided Drug Design" "Curr. Comput.-Aided Drug Des.")
    ("CURRORGSYNT" "Current Organic Synthesis" "Curr. Org. Synth.")
    ("CURRMEDCHEM" "Current Medicinal Chemistry" "Curr. Med. Chem.")
    ("CURRMOLMED" "Current Molecular Medicine" "Curr. Mol. Med.")
    ("CURRONCOREP" "Current Oncology Reports" "Curr. Oncol. Rep.")
    ("CURRTOPMEDCHEM" "Current Topics in Medicinal Chemistry" "Curr. Top. Med. Chem.")
    ("DALTTRANS" "Dalton Transactions" "Dalton Trans.")
    ("DDTODAY" "Drug Discovery Today" "Drug Discov. Today")
    ("DDDEVT" "Drug Design, Development and Therapy" "Drug Des. Dev. Ther.")
    ("DMP" "Drug Metabolism and Disposition" "Drug Metab. Dispos.")
    ("EJDMETPK" "European Journal of Drug Metabolism and Pharmacokinetics" "Eur. J. Drug Metabol. Pharmacokinet.")
    ("EJMEDCHEM" "European Journal of Medicinal Chemistry" "Eur. J. Med. Chem.")
    ("EJMEDCHEMR" "European Journal of Medicinal Chemistry Reports" "Eur. J. Med. Chem. Rep.")
    ("EJPHARMACOL" "European Journal of Pharmacology" "Eur. J. Pharmacol.")
    ("EJORGCHEM" "European Journal of Organic Chemistry" "Eur. J. Org. Chem.")
    ("EXPMOLMED" "Experimental &amp; Molecular Medicine" "Exp. Mol. Med.")
    ("EXPODD" "Expert Opinion on Drug Discovery" "Expert. Opin. Drug Discov.")
    ("EXOID" "Expert Opinion on Investigational Drugs" "Expert Opin. Investig. Drugs")
    ("EXPOTP" "Expert Opinion on Therapeutic Patents" "Expert Opin. Ther. Patents")
    ("EXPRAT" "Expert Review of Anticancer Therapy" "Expert Rev. Anticancer Ther")
    ("EXPRCP" "Expert Review of Clinical Pharmacology" "Expert Rev. Clin. Pharmacol.")
    ("EJC" "European Journal of Cancer" "Eur. J. Cancer")
    ("FRONTCHEM" "Frontiers in Chemistry" "Front. Chem.")
    ("FRONTMOLBIO" "Frontiers in Molecular Biosciences" "Front. Mol. Biosci.")
    ("FRONTPHARMACO" "Frontiers in Pharmacology" "Front. Pharmacol.")
    ("FUTMEDCHEM" "Future Medicinal Chemistry" "Future Med. Chem.")
    ("INORGCHEM" "Inorganic Chemistry" "Inorg. Chem.")
    ("IND" "Investigational New Drugs" "Invest. New Drugs")
    ("IJC" "International Journal of Cancer" "Int. J. Cancer")
    ("IJLSPR" "International Journal of Life Science and Pharma Research" "Int. J. Life Sci. Pharma Res.")
    ("IJMS" "International Journal of Molecular Sciences" "Int. J. Mol. Sci.")
    ("IJO" "International Journal of Oncology" "Int. J. Oncol.")
    ("ICA" "Inorganica Chimica Acta" "Inorg. Chim. Acta")
    ("JCOPO" "JCO Precision Oncology" "JCO Precis. Oncol.")
    ("JMEDCHEM" "Journal of Medicinal Chemistry" "J. Med. Chem.")
    ("IRJPAC" "International Research Journal of Pure and Applied Chemistry" "Int. Res. J. Pure Appl. Chem.")
    ("JBIC" "Journal of Biological Inorganic Chemistry" "J. Biol. Inorg. Chem.")
    ("JBSD" "Journal of Biomolecular Structure and Dynamics" "J. Biomol. Struct. Dyn.")
    ("JBO" "Journal of Bone Oncology" "J. Bone Oncol.")
    ("JCRCO" "Journal of Cancer Research and Clinical Oncology" "J. Cancer Res. Clin. Oncol.")
    ("JCELLBIO" "Journal of Cellular Biochemistry" "J. Cell. Biochem.")
    ("JCHEM" "Journal of Chemistry" "J. Chem.")
    ("JCIM" "Journal of Chemical Information and Modeling" "J. Chem Inf. Model.")
    ("JCONCO" "Journal of Clinical Oncology" "J. Clin. Oncol.")
    ("JCLINPATHO" "Journal of Clinical Pathology" "J. Clin. Pathol.")
    ("JCOORCHEM" "Journal of Coordination Chemistry" "J. Coord. Chem.")
    ("JEIMC" "Journal of Enzyme Inhibition and Medicinal Chemistry" "J. Enzym. Inhib. Med. Chem.")
    ("JECCR" "Journal of Experimental &amp; Clinical Cancer Research" "J. Exp. Clin. Cancer Res.")
    ("JETO" "Journal of Experimental Therapeutics and Oncology" "J. Exp. Ther. Oncol.")
    ("JICHEMSOC" "Journal of the Indian Chemical Society" "J. Indian Chem. Soc.")
    ("JINORGBIOCHEM" "Journal of Inorganic Biochemistry" "J. Inorg. Biochem.")
    ("JHETCHEM" "Journal of Heterocyclic Chemistry" "J. Heterocycl. Chem.")
    ("JNEURONC" "Journal of Neuro-Oncology" "J. Neuro-Oncol.")
    ("JONCPHARP" "Journal of Oncology Pharmacy Practice" "J. Oncol. Pharm. Pract.")
    ("JPS" "Journal of Pharmaceutical Sciences" "J. Pharm. Sci.")
    ("JPP" "Journal of Pharmacy and Pharmacology" "J. Pharm. Pharmacol.")
    ("JPET" "Journal of Pharmacology and Experimental Therapeutics" "J. Pharmacol. Exp. Ther.")
    ("JPBA" "Journal of Pharmaceutical and Biomedical Analysis" "J. Pharm. Biomed. Anal.")
    ("JPP" "Journal of Physiology and Pharmacology" "J. Physiol. Pharmacol.")
    ("JNCI" "JNCI Journal of the National Cancer Institute" "JNCI-J. Natl. Cancer Inst.")
    ("JOSS" "Journal of Open Source Software" "J. Open Source Softw.")
    ("JORGCHEM" "The Journal of Organic Chemistry" "J. Org. Chem.")
    ("JMOLSTRUC" "Journal of Molecular Structure" "J. Mol. Struct.")
    ("LANCETHEMATO" "The Lancet Haematology" "Lancet Haematol.")
    ("MATERTODPROC" "Materials Today: Proceedings" "Mater. Today Proc.")
    ("MEDCHEM" "Medicinal Chemistry" "Med. Chem.")
    ("MEDCHEMRES" "Medicinal Chemistry Research" "Med. Chem. Res.")
    ("MINIREVMEDCHEM" "Mini-Reviews in Medicinal Chemistry" "Mini-Rev. Med. Chem.")
    ("MICROBIOLSPEC" "Microbiology Spectrum" "Microbiol. Spectr.")
    ("Molecules" "Molecules" "Molecules")
    ("MOLCAN" "Molecular Cancer" "Mol. Cancer")
    ("MOLCAR" "Molecular Carcinogenesis" "Mol. Carcinog.")
    ("MOLCALTHER" "Molecular Cancer Therapeutics" "Mol. Cancer Ther.")
    ("MOLDIV" "Molecular Diversity" "Mol. Divers.")
    ("MOLMED" "Molecular Medicine" "Mol. Med.")
    ("MOLPHARM" "Molecular Pharmaceutics" "Mol. Pharm.")
    ("MOLPHARMACO" "Molecular Pharmacology" "Mol. Pharmacol.")
    ("NATMAT" "Nature Materials" "Nat. Mater.")
    ("NATMED" "Nature Medicine" "Nat. Med.")
    ("NATREVDD" "Nature Reviews Drug Discovery" "Nat. Rev. Drug Discov.")
    ("NATREVMCB" "Nature Reviews Molecular Cell Biology" "Nat. Rev. Mol. Cell Biol.")
    ("NATREVCAN" "Nature Reviews Cancer" "Nat. Rev. Cancer")
    ("NATCHEMBIO" "Nature Chemical Biology" "Nat. Chem. Biol.")
    ("NEJMED" "New England Journal of Medicine" "N. Engl. J. Med.")
    ("NJCHEM" "New Journal of Chemistry" "New J. Chem.")
    ("NUCACRES" "Nucleic Acids Research" "Nucleic Acids Res.")
    ("OBIOCHEM" "Organic &amp; Biomolecular Chemistry" "Org. Biomol. Chem.")
    ("ONCOREP" "Oncology Reports" "Oncol. Rep.")
    ("PBC" "Pediatric Blood &amp; Cancer" "Pediatr. Blood Cancer")
    ("Pharmaceuticals" "Pharmaceuticals" "Pharmaceuticals")
    ("PCJ" "Pharmaceutical Chemistry Journal" "Pharm. Chem. J.")
    ("PHARMACOLRES" "Pharmacological Research" "Pharmacol. Res.")
    ("PHARMACOLTHER" "Pharmacology &amp; Therapeutics" "Pharmacol. Ther.")
    ("PCPB" "Photochemistry and Photobiology" "Photochem. Photobiol.")
    ("PLOSONE" "PLoS One" "PLoS One")
    ("PAROC" "Polycyclic Aromatic Compounds" "Polycycl. Aromat. Compd.")
    ("PNAS" "Proceedings of the National Academy of Sciences" "PNAS")
    ("PBMB" "Progress in Biophysics and Molecular Biology" "Prog. Biophys. Mol. Biol.")
    ("RADIOONC" "Radiotherapy and Oncology" "Radiother. Oncol.")
    ("RADIAONC" "Radiation Oncology" "Radiat. Oncol.")
    ("RSCA" "RSC Advances" "RSC Adv.")
    ("RJGC" "Russian Journal of General Chemistry" "Russ. J. Gen. Chem.")
    ("RJBC" "Russian Journal of Bioorganic Chemistry" "Russ. J. Bioorg. Chem.")
    ("RPS" "Research in Pharmaceutical Sciences" "Res. Pharm. Sci.")
    ("RVS" "Research in Veterinary Science" "Res. Vet. Sci.")
    ("SAPAMBS" "Spectrochimica Acta Part A: Molecular and Biomolecular Spectroscopy" "Spectroc. Acta Pt. A-Molec. Biomolec. Spectr.")
    ("SCIREP" "Scientific Reports" "Sci Rep")
    ("STTT" "Signal Transduction and Targeted Therapy" "Signal Transduct. Target. Ther.")
    ("SYNTCOM" "Synthetic Communications" "Synth. Commun.")
    ("THERADMEDONCOL" "Therapeutic Advances in Medical Oncology" "Ther. Adv. Med. Oncol.")
    ("TETLETT" "Tetrahedron Letters" "Tetrahedron Lett.")
    ("TPS" "Trends in Pharmacological Sciences" "Trends Pharmacol. Sci.")
    )
  "List of (string journal-full-name journal-abbreviation)")
#+end_src

#+begin_src emacs-lisp :tangle yes
(defun jmax-bibtex-generate-longtitles ()
  (interactive)
  (with-temp-file "longtitles.bib"
    (dolist (row bibtex-abbreviations)
      (insert (format "@string{%s=\"%s\"}\n"
                      (nth 0 row)
                      (nth 1 row))))))

(defun jmax-bibtex-generate-shorttitles ()
  (interactive)
  (with-temp-file "shorttitles.bib"
    (dolist (row bibtex-abbreviations)
      (insert (format "@string{%s=\"%s\"}\n"
                      (nth 0 row)
                      (nth 2 row))))))
#+end_src

#+begin_src emacs-lisp :tangle yes
(defun jmax-stringify-journal-name (&optional key start end)
  "replace journal name with a string. The strings are defined in `bibtex-abbreviations'."
  (interactive)
  (bibtex-beginning-of-entry)
  (when
      (string= "article"
               (downcase
                (cdr (assoc "=type=" (bibtex-parse-entry)))))
    (let* ((full-names (mapcar
                        (lambda (row)
                          (cons  (nth 1 row) (nth 0 row)))
                        bibtex-abbreviations))
           (abbrev-names (mapcar
                          (lambda (row)
                            (cons  (nth 2 row) (nth 0 row)))
                          bibtex-abbreviations))
           (journal (s-trim (bibtex-autokey-get-field "journal")))
           (bstring (or
                     (cdr (assoc journal full-names))
                     (cdr (assoc journal abbrev-names)))))
      (when bstring
        (bibtex-set-field "journal" bstring t)
        (bibtex-fill-entry)))))
#+end_src

#+begin_src emacs-lisp :tangle yes
(bibtex-map-entries 'jmax-stringify-journal-name)
#+end_src

