config.org
*** Default image size

#+begin_src emacs-lisp :tangle yes
(setq org-latex-image-default-width nil)
#+end_src
** Export to iPython Notebook
This package conflicts with Doom Emacs jupyter configuration !
#+begin_src emacs-lisp :tangle no
(use-package ox-ipynb
  :after ox)
#+end_src

** HTML export fixes

#+BEGIN_SRC emacs-lisp :tangle yes
;;				Last Update HTML
(defun my-org-html-postamble (plist)
 (format "Last update : %s" (format-time-string "%d %b %Y")))
(setq org-html-postamble 'my-org-html-postamble)
#+END_SRC

* Opening files

** MS files

#+begin_src emacs-lisp :tangle yes
 (setq org-file-apps
    '(
      ("\\.docx\\'" . default)
      ("\\.pptx\\'" . default)
      ))
#+end_src

* Misc

** Evil mode

Go back to normal mode after 10s of inactivity

#+begin_src emacs-lisp :tangle yes
(defun evil-normalize-all-buffers ()
  "Force a drop to normal state."
  (unless (eq evil-state 'normal)
    (dolist (buffer (buffer-list))
      (set-buffer buffer)
      (unless (or (minibufferp)
                  (eq evil-state 'emacs))
        (evil-force-normal-state)))
    (message "Dropped back to normal state in all buffers")))
#+end_src

#+begin_src emacs-lisp :tangle yes
(defvar evil-normal-timer
  (run-with-idle-timer 10 t #'evil-normalize-all-buffers)
  "Drop back to normal state after idle for 30 seconds.")
#+end_src

Save the buffer after exiting insert mode

#+begin_src emacs-lisp :tangle yes
(add-hook 'evil-insert-state-exit-hook
          (lambda ()
            (call-interactively #'save-buffer)))

(with-eval-after-load 'evil-maps
    (define-key evil-insert-state-map (kbd "s-i") 'evil-normal-state))
#+end_src

Exit insert mode after saving buffer

#+begin_src emacs-lisp :tangle yes
(add-hook 'save-buffer
          (lambda ()
            (call-interactively #'evil-insert-state-exit-hook)))

(with-eval-after-load 'evil-maps
    (define-key evil-insert-state-map (kbd "s-s") 'evil-normal-state))
#+end_src
